; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_7)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 - boat
		p0 p1 p2 p3 p4 p5 p6 - person
	)

  (:init
		(= (x b0) 4)
(= (y b0) 0)
(= (x b1) -10)
(= (y b1) 0)
(= (x b2) -5)
(= (y b2) 0)
(= (x b3) 2)
(= (y b3) 0)
(= (x b4) -10)
(= (y b4) 0)
(= (x b5) 6)
(= (y b5) 0)
(= (x b6) 9)
(= (y b6) 0)
(= (x b7) -5)
(= (y b7) 0)
(= (x b8) -6)
(= (y b8) 0)
(= (x b9) -1)
(= (y b9) 0)
(= (x b10) 7)
(= (y b10) 0)
(= (x b11) 1)
(= (y b11) 0)

		(= (d p0) 41)
(= (d p1) 4)
(= (d p2) 76)
(= (d p3) 4)
(= (d p4) 26)
(= (d p5) 31)
(= (d p6) 93)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
		)
	)
)

; plan
1. (go_north_west b11)
   changed: (x b11) from 1 to -0.5, (y b11) from 0 to 1.5
   goals met: 0 of 7
2. (go_north_east b11)
   changed: (x b11) from -0.5 to 1, (y b11) from 1.5 to 3
   goals met: 0 of 7
3. (go_north_east b11)
   changed: (x b11) from 1 to 2.5, (y b11) from 3 to 4.5
   goals met: 0 of 7
4. (go_north_east b11)
   changed: (x b11) from 2.5 to 4, (y b11) from 4.5 to 6
   goals met: 0 of 7
5. (go_north_east b11)
   changed: (x b11) from 4 to 5.5, (y b11) from 6 to 7.5
   goals met: 0 of 7
6. (go_north_east b11)
   changed: (x b11) from 5.5 to 7, (y b11) from 7.5 to 9
   goals met: 0 of 7
7. (go_north_east b11)
   changed: (x b11) from 7 to 8.5, (y b11) from 9 to 10.5
   goals met: 0 of 7
8. (go_north_east b11)
   changed: (x b11) from 8.5 to 10, (y b11) from 10.5 to 12
   goals met: 0 of 7
9. (go_north_east b11)
   changed: (x b11) from 10 to 11.5, (y b11) from 12 to 13.5
   goals met: 0 of 7
10. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 13.5 to 15
   goals met: 0 of 7
11. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 15 to 16.5
   goals met: 0 of 7
12. (save_person b11 p1)
   added: (saved p1)
   goals met: 1 of 7
13. (save_person b11 p3)
   added: (saved p3)
   goals met: 2 of 7
14. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 16.5 to 18
   goals met: 2 of 7
15. (go_north_east b11)
   changed: (x b11) from 13 to 14.5, (y b11) from 18 to 19.5
   goals met: 2 of 7
16. (go_north_east b11)
   changed: (x b11) from 14.5 to 16, (y b11) from 19.5 to 21
   goals met: 2 of 7
17. (go_north_east b11)
   changed: (x b11) from 16 to 17.5, (y b11) from 21 to 22.5
   goals met: 2 of 7
18. (go_north_east b11)
   changed: (x b11) from 17.5 to 19, (y b11) from 22.5 to 24
   goals met: 2 of 7
19. (go_north_east b11)
   changed: (x b11) from 19 to 20.5, (y b11) from 24 to 25.5
   goals met: 2 of 7
20. (go_north_east b11)
   changed: (x b11) from 20.5 to 22, (y b11) from 25.5 to 27
   goals met: 2 of 7
21. (go_north_west b11)
   changed: (x b11) from 22 to 20.5, (y b11) from 27 to 28.5
   goals met: 2 of 7
22. (go_north_west b11)
   changed: (x b11) from 20.5 to 19, (y b11) from 28.5 to 30
   goals met: 2 of 7
23. (go_north_west b11)
   changed: (x b11) from 19 to 17.5, (y b11) from 30 to 31.5
   goals met: 2 of 7
24. (go_north_west b11)
   changed: (x b11) from 17.5 to 16, (y b11) from 31.5 to 33
   goals met: 2 of 7
25. (go_north_west b11)
   changed: (x b11) from 16 to 14.5, (y b11) from 33 to 34.5
   goals met: 2 of 7
26. (go_north_west b11)
   changed: (x b11) from 14.5 to 13, (y b11) from 34.5 to 36
   goals met: 2 of 7
27. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 36 to 37.5
   goals met: 2 of 7
28. (save_person b11 p4)
   added: (saved p4)
   goals met: 3 of 7
29. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 37.5 to 39
   goals met: 3 of 7
30. (go_north_east b11)
   changed: (x b11) from 13 to 14.5, (y b11) from 39 to 40.5
   goals met: 3 of 7
31. (go_north_west b11)
   changed: (x b11) from 14.5 to 13, (y b11) from 40.5 to 42
   goals met: 3 of 7
32. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 42 to 43.5
   goals met: 3 of 7
33. (save_person b11 p5)
   added: (saved p5)
   goals met: 4 of 7
34. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 43.5 to 45
   goals met: 4 of 7
35. (go_north_east b11)
   changed: (x b11) from 13 to 14.5, (y b11) from 45 to 46.5
   goals met: 4 of 7
36. (go_north_east b11)
   changed: (x b11) from 14.5 to 16, (y b11) from 46.5 to 48
   goals met: 4 of 7
37. (go_north_west b11)
   changed: (x b11) from 16 to 14.5, (y b11) from 48 to 49.5
   goals met: 4 of 7
38. (go_north_west b11)
   changed: (x b11) from 14.5 to 13, (y b11) from 49.5 to 51
   goals met: 4 of 7
39. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 51 to 52.5
   goals met: 4 of 7
40. (save_person b11 p0)
   added: (saved p0)
   goals met: 5 of 7
41. (go_north_east b11)
   changed: (x b11) from 11.5 to 13, (y b11) from 52.5 to 54
   goals met: 5 of 7
42. (go_north_east b11)
   changed: (x b11) from 13 to 14.5, (y b11) from 54 to 55.5
   goals met: 5 of 7
43. (go_north_east b11)
   changed: (x b11) from 14.5 to 16, (y b11) from 55.5 to 57
   goals met: 5 of 7
44. (go_north_east b11)
   changed: (x b11) from 16 to 17.5, (y b11) from 57 to 58.5
   goals met: 5 of 7
45. (go_north_east b11)
   changed: (x b11) from 17.5 to 19, (y b11) from 58.5 to 60
   goals met: 5 of 7
46. (go_north_east b11)
   changed: (x b11) from 19 to 20.5, (y b11) from 60 to 61.5
   goals met: 5 of 7
47. (go_north_east b11)
   changed: (x b11) from 20.5 to 22, (y b11) from 61.5 to 63
   goals met: 5 of 7
48. (go_north_east b11)
   changed: (x b11) from 22 to 23.5, (y b11) from 63 to 64.5
   goals met: 5 of 7
49. (go_north_east b11)
   changed: (x b11) from 23.5 to 25, (y b11) from 64.5 to 66
   goals met: 5 of 7
50. (go_north_east b11)
   changed: (x b11) from 25 to 26.5, (y b11) from 66 to 67.5
   goals met: 5 of 7
51. (go_north_west b11)
   changed: (x b11) from 26.5 to 25, (y b11) from 67.5 to 69
   goals met: 5 of 7
52. (go_north_west b11)
   changed: (x b11) from 25 to 23.5, (y b11) from 69 to 70.5
   goals met: 5 of 7
53. (go_north_west b11)
   changed: (x b11) from 23.5 to 22, (y b11) from 70.5 to 72
   goals met: 5 of 7
54. (go_north_west b11)
   changed: (x b11) from 22 to 20.5, (y b11) from 72 to 73.5
   goals met: 5 of 7
55. (go_north_west b11)
   changed: (x b11) from 20.5 to 19, (y b11) from 73.5 to 75
   goals met: 5 of 7
56. (go_north_west b11)
   changed: (x b11) from 19 to 17.5, (y b11) from 75 to 76.5
   goals met: 5 of 7
57. (go_north_west b11)
   changed: (x b11) from 17.5 to 16, (y b11) from 76.5 to 78
   goals met: 5 of 7
58. (go_north_west b11)
   changed: (x b11) from 16 to 14.5, (y b11) from 78 to 79.5
   goals met: 5 of 7
59. (go_north_west b11)
   changed: (x b11) from 14.5 to 13, (y b11) from 79.5 to 81
   goals met: 5 of 7
60. (go_north_west b11)
   changed: (x b11) from 13 to 11.5, (y b11) from 81 to 82.5
   goals met: 5 of 7
61. (go_north_west b11)
   changed: (x b11) from 11.5 to 10, (y b11) from 82.5 to 84
   goals met: 5 of 7
62. (go_north_west b11)
   changed: (x b11) from 10 to 8.5, (y b11) from 84 to 85.5
   goals met: 5 of 7
63. (save_person b11 p2)
   added: (saved p2)
   goals met: 6 of 7
64. (go_north_west b11)
   changed: (x b11) from 8.5 to 7, (y b11) from 85.5 to 87
   goals met: 6 of 7
65. (go_north_west b11)
   changed: (x b11) from 7 to 5.5, (y b11) from 87 to 88.5
   goals met: 6 of 7
66. (go_north_west b11)
   changed: (x b11) from 5.5 to 4, (y b11) from 88.5 to 90
   goals met: 6 of 7
67. (go_north_west b11)
   changed: (x b11) from 4 to 2.5, (y b11) from 90 to 91.5
   goals met: 6 of 7
68. (go_north_west b11)
   changed: (x b11) from 2.5 to 1, (y b11) from 91.5 to 93
   goals met: 6 of 7
69. (go_north_west b11)
   changed: (x b11) from 1 to -0.5, (y b11) from 93 to 94.5
   goals met: 6 of 7
70. (save_person b11 p6)
   added: (saved p6)
   goals met: 7 of 7
